# -*- coding: utf-8 -*-"
#+STARTUP: overview indent
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION:
#+KEYWORDS:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 9.0.1)
#+LATEX_HEADER:
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export
#+TAGS: noexport(n) deprecated(d)

* Planejamento                                                     :noexport:
** Modelo do cronograma em TEX                                      :ATTACH:
:PROPERTIES:
:Attachments: layout-cronograma.tex
:ID:       be43e1ff-0a91-4c3f-9e17-1fa62e6795ce
:END:

** Aulas (em ORG)

#+NAME: listagem_de_encontros
| Setor      | Descrição                                                        |     Local | Projeto             |
|------------+------------------------------------------------------------------+-----------+---------------------|
|            | Definições, requisitos e posicionamento da disciplina            |           | Definições iniciais |
| Léxica     | Introdução, Expressões Regulares, =flex=                           |           | Início E1 (flex)    |
| Léxica     | Autômato Finito Determinístico, Conv. AFND para AFD, =flex= (demo) |           |                     |
| Sintática  | Intro., Gramáticas Livres de Contexto, Transformações            |           |                     |
| Sintática  | Desc., com Retrocesso, Preditivo (Primeiro, Sequência)           |           |                     |
| Sintática  | Parser e tabela LL(1), Exercício LL(1), =bison=                    |           | Início E2 (bison)   |
| Sintática  | Ascendente, Parser LR(0), SLR(1) , =bison= (demo)                  |           |                     |
| Sintática  | Exercícios LR(0), SLR(1)                                         |           |                     |
| Sintática  | Parser LR(1), LALR(1)                                            |           |                     |
| Sintática  | Exercícios LR(1), e LALR(1), AST e =bison= (ações)                 |           |                     |
|            |                                                                  | 43413-104 | Avaliação E1, E2    |
| Semântica  | Esquemas S e L-Atribuídos                                        |           | Início E3 (Árvore)  |
| Semântica  | Implementação de Esquemas S e L-Atribuídos                       |           |                     |
|            | Revisão                                                          |           | Início E4 (Tipos)   |
|            | P1                                                               |           |                     |
| Código     | Declarações, Escopos e Atribuição                                |           |                     |
|            |                                                                  | 43413-104 | Avaliação E3        |
| Código     | Expressões Lógicas com atalho, Controle de Fluxo                 |           |                     |
| Código     | Endereçamento de Arranjos multidimensionais                      |           |                     |
| Código     | Controle de Fluxo                                                |           | Início E5 (Código)  |
|            |                                                                  | 43413-103 | Avaliação E4        |
| Código     | Controle de Fluxo                                                |           |                     |
| Execução   | Introdução, Registro de Ativação                                 |           |                     |
| Execução   | Chamada e retorno de Função, Passagem de parâmetros              |           | Início E6 (Chamada) |
| Otimização | Introdução, Janela e Grafos de Fluxo                             |           |                     |
|            |                                                                  | 43413-103 | Avaliação E5        |
| Otimização | Grafos de Fluxo e Redução de potência                            |           |                     |
|            | Revisão                                                          |           |                     |
|            | P2                                                               |           |                     |
|            | PR                                                               |           |                     |

** Cronograma (para TEX)

#+name: cronograma
#+header: :var aulas=listagem_de_encontros
#+begin_src R :results output :session :exports both
suppressMessages(library(lubridate));
suppressMessages(library(tidyverse));
suppressMessages(library(xtable));

aulas <- aulas %>% as_tibble();

daysOff <- c(
ymd("2019-04-19"), # Religioso
ymd("2019-04-20"), # Não letivo
ymd("2019-04-21"), # Tiradentes
ymd("2019-05-01"), # Trabalho
ymd("2019-05-18"), # Portas Abert
ymd("2019-06-20"), # Religioso
ymd("2019-09-07"), # Independência
ymd("2019-09-20"), # Farroupilha
ymd("2019-10-12"), # Religioso
ymd("2019-10-20"), # Não Letivo
ymd("2019-10-21"), # SEMAC
ymd("2019-10-22"), # SEMAC
ymd("2019-10-23"), # SEMAC
ymd("2019-10-24"), # SEMAC
ymd("2019-10-25"), # SEMAC
ymd("2019-10-28"), # Dia do Servidor Público
ymd("2019-11-02"), # Mortos
ymd("2019-11-15"), # República
ymd("2019-11-23"), # Não Letivo
ymd("2019-11-30")  # Não Letivo
)

dataDaRecuperação <- ymd("2019-12-02");

dates <- tibble(Dia=seq(ymd("2019-08-12"), ymd("2020-01-11"), by="days")) %>%
    # Define o dia da semana
    mutate(DiaDaSemana = wday(Dia)) %>%
    # Aulas de Compiladores em quais dias da semana (segunda = 2, terca = 3, ...)
    filter(DiaDaSemana %in% c(2, 4)) %>%
    # Remove dias onde não haverá aula
    filter(!(Dia %in% daysOff));

aulas %>%
    # Associa as datas
    bind_cols(dates %>% slice(1:nrow(aulas))) %>%
    # Altera a data da PR
    mutate(Dia = case_when (grepl("PR", Descrição) ~ dataDaRecuperação,
                            TRUE ~ Dia)) %>%
    # Converte as datas para caracter
    mutate(Encontro = as.character(Dia)) %>%
    # Ordena as aulas
    mutate(N = 1:nrow(.)) -> aulas;

aulas %>%
    select(N, Encontro, Local, Setor, Descrição, Projeto) %>%
    as.data.frame() %>%
    xtable(.) %>%
    print (print.results=FALSE,
           booktabs = TRUE,
           include.rownames=FALSE) %>%
    as.character -> cronograma;
#+end_src

#+RESULTS: cronograma

#+begin_src R :results output :session :exports both
aulas %>%
    filter(!is.na(Local))
#+end_src

#+RESULTS:
#+begin_example

# A tibble: 30 x 8
   Setor  Descrição         Local Projeto  Dia        DiaDaSemana Encontro     N
   <chr>  <chr>             <chr> <chr>    <date>           <dbl> <chr>    <int>
 1 ""     Definições, requ… ""    Definiç… 2019-08-12           2 2019-08…     1
 2 Léxica Introdução, Expr… ""    Início … 2019-08-14           4 2019-08…     2
 3 Léxica Autômato Finito … ""    ""       2019-08-19           2 2019-08…     3
 4 Sintá… Intro., Gramátic… ""    ""       2019-08-21           4 2019-08…     4
 5 Sintá… Desc., com Retro… ""    ""       2019-08-26           2 2019-08…     5
 6 Sintá… Parser e tabela … ""    Início … 2019-08-28           4 2019-08…     6
 7 Sintá… Ascendente, Pars… ""    ""       2019-09-02           2 2019-09…     7
 8 Sintá… Exercícios LR(0)… ""    ""       2019-09-04           4 2019-09…     8
 9 Sintá… Parser LR(1), LA… ""    ""       2019-09-09           2 2019-09…     9
10 Sintá… Exercícios LR(1)… ""    Início … 2019-09-11           4 2019-09…    10
# … with 20 more rows
#+end_example

** Dias por etapa do projeto (em R)

#+name: dias_por_etapa
#+header: :var dep=cronograma
#+begin_src R :results output :session :exports both
aulas %>%
    select(Projeto, Dia) %>%
    filter(grepl("Início", Projeto)) %>%
    mutate(Projeto = gsub("Início ", "", Projeto)) %>%
    mutate(Projeto = gsub(" \\(.*$", "", Projeto)) %>%
    rename(Início = Dia) %>%
    left_join(
        aulas %>%
        select(Projeto, Dia) %>%
        filter(grepl("Avaliação", Projeto)) %>%
        mutate(Projeto = gsub("Avaliação ", "", Projeto)) %>%
        mutate(Projeto = strsplit(Projeto, ",")) %>%
        unnest(Projeto) %>%
        mutate(Projeto = trimws(Projeto)) %>%
        rename(Fim = Dia) %>%
        bind_rows(
            tribble(~Projeto, ~Fim,
                    "E6", (aulas %>%
                           filter(Descrição == "P2") %>%
                           pull(Encontro) %>%
                           as.Date)))
    ) %>%
    mutate(Duração = as.integer(Fim - Início)) %>%
    mutate(Texto = gsub("Início ", "", paste0(Projeto, " = ", Duração))) -> dias_por_etapa
#+end_src

#+RESULTS: dias_por_etapa
: 
: Joining, by = "Projeto"

** Cronograma (em PDF)

#+name: modelo_cronograma
#+header: :var dep0=cronograma
#+header: :var dep1=dias_por_etapa
#+begin_src R :results output :session :exports both
cronograma.modelo.filename = "data/be/43e1ff-0a91-4c3f-9e17-1fa62e6795ce/layout-cronograma.tex"
cronograma.modelo = readChar(cronograma.modelo.filename, file.info(cronograma.modelo.filename)$size);
turma = "A";
semestre = "2019/2 -- Inverno/Primavera";
cronograma.modelo <- gsub("TURMA", turma, cronograma.modelo);
cronograma.modelo <- gsub("SEMESTRE", semestre, cronograma.modelo);
cronograma.modelo <- gsub("TABELA", gsub("\\\\", "\\\\\\\\", cronograma), cronograma.modelo);
cronograma.modelo <- gsub("DIASPORETAPA", paste(dias_por_etapa$Texto, collapse=", "), cronograma.modelo);
write(cronograma.modelo, "cronograma.tex");
system2("rm", "-f cronograma.pdf")
system2("rubber", " --pdf cronograma.tex")
#+end_src

#+RESULTS: modelo_cronograma
: 
: compiling cronograma.tex...

* Cronograma

O cronograma também está [[./cronograma.pdf][disponível em formato PDF]].

#+header: :var dep=cronograma
#+begin_src R :results value table :session :exports output :colnames yes
aulas %>%
    select(N, Encontro, Local, Setor, Descrição, Projeto) %>%
    as.data.frame
#+end_src

#+RESULTS:
|  N |   Encontro |     Local | Setor      | Descrição                                                        | Projeto             |
|----+------------+-----------+------------+------------------------------------------------------------------+---------------------|
|  1 | 2019-08-12 |           |            | Definições, requisitos e posicionamento da disciplina            | Definições iniciais |
|  2 | 2019-08-14 |           | Léxica     | Introdução, Expressões Regulares, =flex=                           | Início E1 (flex)    |
|  3 | 2019-08-19 |           | Léxica     | Autômato Finito Determinístico, Conv. AFND para AFD, =flex= (demo) |                     |
|  4 | 2019-08-21 |           | Sintática  | Intro., Gramáticas Livres de Contexto, Transformações            |                     |
|  5 | 2019-08-26 |           | Sintática  | Desc., com Retrocesso, Preditivo (Primeiro, Sequência)           |                     |
|  6 | 2019-08-28 |           | Sintática  | Parser e tabela LL(1), Exercício LL(1), =bison=                    | Início E2 (bison)   |
|  7 | 2019-09-02 |           | Sintática  | Ascendente, Parser LR(0), SLR(1) , =bison= (demo)                  |                     |
|  8 | 2019-09-04 |           | Sintática  | Exercícios LR(0), SLR(1)                                         |                     |
|  9 | 2019-09-09 |           | Sintática  | Parser LR(1), LALR(1)                                            |                     |
| 10 | 2019-09-11 |           | Sintática  | Exercícios LR(1), e LALR(1), AST e =bison= (ações)                 |                     |
| 11 | 2019-09-16 | 43413-104 |            |                                                                  | Avaliação E1, E2    |
| 12 | 2019-09-18 |           | Semântica  | Esquemas S e L-Atribuídos                                        | Início E3 (Árvore)  |
| 13 | 2019-09-23 |           | Semântica  | Implementação de Esquemas S e L-Atribuídos                       |                     |
| 14 | 2019-09-25 |           |            | Revisão                                                          | Início E4 (Tipos)   |
| 15 | 2019-09-30 |           |            | P1                                                               |                     |
| 16 | 2019-10-02 |           | Código     | Declarações, Escopos e Atribuição                                |                     |
| 17 | 2019-10-07 | 43413-104 |            |                                                                  | Avaliação E3        |
| 18 | 2019-10-09 |           | Código     | Expressões Lógicas com atalho, Controle de Fluxo                 |                     |
| 19 | 2019-10-14 |           | Código     | Endereçamento de Arranjos multidimensionais                      |                     |
| 20 | 2019-10-16 |           | Código     | Controle de Fluxo                                                | Início E5 (Código)  |
| 21 | 2019-10-30 | 43413-103 |            |                                                                  | Avaliação E4        |
| 22 | 2019-11-04 |           | Código     | Controle de Fluxo                                                |                     |
| 23 | 2019-11-06 |           | Execução   | Introdução, Registro de Ativação                                 |                     |
| 24 | 2019-11-11 |           | Execução   | Chamada e retorno de Função, Passagem de parâmetros              | Início E6 (Chamada) |
| 25 | 2019-11-13 |           | Otimização | Introdução, Janela e Grafos de Fluxo                             |                     |
| 26 | 2019-11-18 | 43413-103 |            |                                                                  | Avaliação E5        |
| 27 | 2019-11-20 |           | Otimização | Grafos de Fluxo e Redução de potência                            |                     |
| 28 | 2019-11-25 |           |            | Revisão                                                          |                     |
| 29 | 2019-11-27 |           |            | P2                                                               |                     |
| 30 | 2019-12-02 |           |            | PR                                                               |                     |


